{"status":"ok","article_count":28,"articles":[{"id":50010,"thumbnail":"https:\/\/www.tripzilla.com\/wp-content\/uploads\/2016\/12\/Bagan-Featured.jpg","title":"A First-Timer’s Guide to Bagan, Myanmar","url":"https:\/\/www.tripzilla.com\/bagan-first-timer-travel-guide\/50010","publish_at":"2016-12-06 14:00:39","description":"Visiting Bagan for the first time? Here's a handy travel guide for you.","postslug":"bagan-first-timer-travel-guide","author":"Catherine Mirasol","author_avatar_url":{"0":"https:\/\/secure.gravatar.com\/avatar\/0d43c7d982dae6ee4e0059a73b3d2579?s=150&d=mm&r=g"},"category":["Bagan","Culture &amp; Heritage","Myanmar","PH","Trip Planning"],"tag":[],"custom_seo_title":null,"custom_seo_description":null,"og_title":null,"og_image":null,"og_des":null,"content":"<p>As someone, who is deeply intrigued by archaeological sites and who has visited Machu Picchu and Angkor Wat, it became pretty obvious to me that the next place I had to visit was the ancient town with the biggest and densest concentration of temples and pagodas in the world -- Bagan. The journey wasn't easy, though, so I made a guide to help out other first-timers out there, who are interested in visiting as well.<\/p>\n<p><span style=\"color: #ff6600\"><em>Also read: <a style=\"color: #ff6600\" href=\"https:\/\/www.tripzilla.com\/bagan-myanmar-sunrise-sunset-landscape-photography\/16406\" target=\"_blank\">A Photographer’s Dream: The Golden Lights of Bagan, Myanmar<\/a><\/em><\/span><\/p>\n<h3>Introducing Bagan<\/h3>\n<p><img class=\"alignnone\" src=\"https:\/\/static.tripzilla.com\/thumb\/a\/a\/65706_700x.jpg\" alt=\"bagan travel guide\" width=\"700\" height=\"466\" \/><\/p>\n<p>Bagan is located on the banks of the Ayeyarwady (Irrawaddy) River, a couple of miles south of Mandalay and north of Yangon. During its golden years as the centre of the Pagan Kingdom, now known as modern-day Myanmar, over 10,000 Buddhists monuments were constructed in its vast plains. However, only around 2,000 of these monuments remain and can be seen today. These monuments tend to be the main reason why travellers (such as myself) flock to Myanmar.<\/p>\n<h3>Best time to visit<\/h3>\n<p><img class=\"alignnone\" src=\"https:\/\/static.tripzilla.com\/thumb\/a\/c\/65708_700x.jpg\" alt=\"guide to bagan\" width=\"700\" height=\"466\" \/><\/p>\n<p>Bagan has a tropical climate so it only has 2 seasons -- wet and dry. The months to avoid are March to May, when Bagan is scorching hot, and June to October, when you'll most likely get drenched. November to February is the ideal time to go as temperatures become a lot more pleasant. However, since this is peak season, you'll have to book everything -- transportation, accommodation and tours -- in advance.<\/p>\n<h3>Visa<\/h3>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/1\/3\/66067_1075x1613.jpg\" alt=\"\" width=\"1075\" height=\"1613\" \/><\/p>\n<p>Foreign nationals, who would like to enter Myanmar for tourism or business purposes, are required to get a visa unless he\/she is a citizen of these Southeast Asian countries: Brunei, Cambodia, Indonesia, Laos, Philippines, Singapore (as of 1 Dec 2016), Thailand (by air only) and Vietnam. Citizens of these aforementioned countries can only stay up to 14 days without a visa. The rest will have to apply for an eVisa or get a visa-on-arrival.<\/p>\n<h3>Getting there<\/h3>\n<p><span style=\"font-weight: 400\">To be perfectly honest, Bagan isn't the easiest place to get to as there are no direct international flights to its closest airport, Nyaung U Airport. But once you touchdown in Myanmar, most likely in Mandalay or Yangon, you'll have a variety of options to reach Bagan. It'll just depend on how much time and money you're willing to spend.<\/span><\/p>\n<p><strong>By plane:<\/strong> If you're pressed for time, flying is the fastest way to Bagan. A lot of domestic airlines from Mandalay, Heho and Yangon have non-stop flights to Nyaung U Airport. A trip will take around 30 minutes from Mandalay, 40 minutes from Heho and an hour and 20 minutes from Yangon. But it'll cost you. The price for one-way ticket starts at around MMK80k.<\/p>\n<p><strong>By bus:<\/strong> Taking a bus -- whether a day or overnight one -- is the most popular way of getting to Bagan because bus services in Myanmar are inexpensive and reliable. Common bus routes to Bagan are from Yangon, Mandalay, Nyaung Shwe, Taunggyi, Kalaw and Pyin Oo Lwin. They have rest stops every few hours plus provide complimentary bottled water and wet wipes to make the journey more comfortable.<\/p>\n<p><strong>By train:<\/strong> A train journey to Bagan can give you scenic views of the countryside. However, trains in Myanmar are less reliable and efficient than buses so you better be patient. Train classes range from ordinary (with simple wooden seats) to first and upper class (with cushioned seats) to sleeper (with sleeping compartments). Nonetheless, it'll be a long and bumpy ride whichever you choose.<\/p>\n<p><strong>By boat:<\/strong> If you're quite adventurous and have all the time in the world, then travelling by boat can be an interesting alternative to the usual modes of transportation. Popular boat routes pass through the Ayeyarwady River. And a trip takes around 12 hours on average.<\/p>\n<p>If you're wondering how I did it... From Manila, I flew to Singapore via Singapore Airlines. Then, after a long layover, I flew to Mandalay via SilkAir. At Mandalay International Airport, I took a shared taxi (only MMK4k compared to MMK12-15k for a private one) to get to the OK Express bus station. Ride sharing is common in Myanmar so it didn't terrify me. The drive from the airport to the bus station in downtown Mandalay took about an hour. I booked my Mandalay-Bagan bus ticket online for around MMK12k so it was easy breezy when I got to the station. The wait was short as my bus left exactly on time. The trip from Mandalay to Bagan took roughly 6 hours but it was quite comfy so I didn't mind. Plus, I was dropped off at my Bagan hotel at no extra cost.<\/p>\n<h3>Getting around<\/h3>\n<p><img class=\"alignnone size-medium\" src=\"https:\/\/static.tripzilla.com\/thumb\/a\/f\/65711_700x.jpg\" alt=\"\" width=\"700\" height=\"466\" \/><\/p>\n<p><span style=\"font-weight: 400\">As soon as you set foot in Bagan, the first thing you should do is... Find a foldable map! Trust me, it'll make your life so much easier. Some hotels hand them out for free. But if yours doesn't, buy one. It'll only cost you MMK1k.<\/span><\/p>\n<p>Once you have a map on-hand, the adventure begins! Here are the ways by which you can discover Bagan:<\/p>\n<p><span style=\"font-weight: 400\"><strong>By private car\/taxi:<\/strong> Hiring a private taxi is the most comfortable way to explore Bagan as all taxis are air-conditioned. If you want to minimise your exposure to heat and dust, this is the way to go. It's pricey, though. Getting one for a whole day costs around MMK35k. And of course, on top of that, you have to give your driver a little tip, especially if he\/she acted like your pseudo-guide throughout the day and was nice and patient.<\/span><\/p>\n<p><strong>By horse cart:<\/strong> If you want to go on tour the 'old fashioned way', hire a horse cart. It's around MMK15-20k for a whole day. But let me just warn you, expect the tour to be slow.<\/p>\n<p><strong>By e-bike\/bicycle:<\/strong> This is the most fun way to get around! It's by far the cheapest too! For a whole day, expect to shell out only around MMK2-5k for a bicycle and around MMK6-8k for an e-bike. I prefer e-bikes over bicycles since I easily get tired. With bicycles, you'll have to be in amazing shape to be able to cover a significant chunk of Bagan in a day. Since e-bikes are powered by batteries, less effort is needed. But I suggest you test the e-bike before you rent it and get the contact details of the rental place in case a problem occurs midday and you'll need assistance.<\/p>\n<p><strong>By hot air balloon:<\/strong> This will definitely cost you an arm and a leg but I'm sure seeing thousands of ancient monuments from above with the sun rising from behind will be nothing short of majestic. Currently, only 2 companies -- Balloons Over Bagan and Oriental Ballooning -- operate hot air balloon flights in Bagan and they only have flights from October to March, when the weather is favourable.<\/p>\n<p>For my trip, I hired a private taxi to take me to the must-see temples and pagodas on my first day, just to make sure I had them covered. For the succeeding days, I just explored the smaller, unnamed temples using an e-bike.<\/p>\n<h3>Money<\/h3>\n<p><img class=\"alignnone\" src=\"https:\/\/static.tripzilla.com\/thumb\/b\/0\/65712_700x.jpg\" alt=\"bagan travel guide\" width=\"700\" height=\"1051\" \/><\/p>\n<p><span style=\"font-weight: 400\">US dollars (USD) and Burmese kyats (MMK) are widely accepted in Bagan. Though, your US dollar notes have to be in pristine condition (no tears, folds or markings) or else, they'll get rejected by locals.<\/span><\/p>\n<p>If you want to exchange money, do it at the airport. Surprisingly, that's where I got the best exchange rate. Your second option should be a bank. Hotels, restaurants and stores will (no doubt) give you poor rates. Never change money with people on the streets -- unless you want to get scammed! Also, a little tip for you: You'll get a better rate if you exchange USD100 bills as compared to smaller denominated ones.<\/p>\n<p>While cash is still king in Bagan, ATMs are now not that difficult to find. In fact, lots of hotels have their own machine. As for credit cards, the number of merchants that accept them is growing but I would advise against relying on plastic to get by. And don't bother with traveller's cheques. Do people actually still use those?<\/p>\n<h3>Culture and customs<\/h3>\n<p><img class=\"alignnone size-medium\" src=\"https:\/\/static.tripzilla.com\/thumb\/b\/1\/65713_700x.jpg\" alt=\"\" width=\"700\" height=\"1049\" \/><\/p>\n<p>Bagan is a predominantly Buddhist town so while the locals are warm and friendly, they are also very conservative. Don't wear revealing clothes if you don't want to draw unwanted attention. In places of worship, your legs and shoulders have to be covered plus you have to remove your socks and shoes before entering. Public displays of affection by couples tend to be frowned upon. As in any country, you visit, social etiquette dictates that you avoid conversations about politics and religion -- even though Myanmar is transitioning to becoming more open and democratic.<\/p>\n<h3>Communication<\/h3>\n<p><span style=\"font-weight: 400\">Yes, Wi-Fi is available (often for free) in hotels and restaurants. Just don't expect it to be fast.<\/span><\/p>\n<p><img class=\"alignnone size-medium\" src=\"https:\/\/static.tripzilla.com\/thumb\/b\/2\/65714_700x.jpg\" alt=\"\" width=\"700\" height=\"1049\" \/><\/p>\n<h3>Safety and security<\/h3>\n<p><span style=\"font-weight: 400\">While some areas, mostly borders, in Myanmar are off-limits to foreigners and tourists because of violent conflicts between independent groups and the government, Bagan, on the other hand, is open and safe. Since tourism is the main source of livelihood here, the town tries to ensure that their visitors have a generally pleasant experience. They even have their own Tourist Police Force, stationed in the main roads, who are always ready to assist tourists-in-distress.<\/span><\/p>\n<p>Of course, even though Bagan is relatively safe in terms of personal security, that doesn't mean you should just let your guard down. As with any tourist town, petty theft and scams are things you should still watch out for.<\/p>\n<h3>Health<\/h3>\n<p>Bagan is hot most of the year so always bring water with you so you won't get dehydrated while exploring. Tap water isn't safe to drink so always buy bottled water.<\/p>\n<p>If ever you spot dogs, squirrels, monkeys or even snakes in Bagan, I suggest you leave them alone -- no matter how cute they seem to you. You don't want to get rabies or snake bites, do you? Although to be fair, I only encountered dogs and squirrels during the 5 days I was in Bagan. So I'm guessing you'll only encounter snakes in fields, not in main temple paths.<\/p>\n<p>Throughout the day, I highly recommend constantly applying sun block and insect repellant to protect yourself against sunburn and insect bites.<\/p>\n<p>And finally, I assume you have health insurance and updated vaccinations whenever and wherever you travel. If not, go get them before your trip! Seriously, no one should ever travel without them!<\/p>\n<h3>Attractions<\/h3>\n<p><img class=\"alignnone size-medium\" src=\"https:\/\/static.tripzilla.com\/thumb\/b\/3\/65715_700x.jpg\" alt=\"\" width=\"700\" height=\"1049\" \/><\/p>\n<p><span style=\"font-weight: 400\">Since there are over 2,000 temples and pagodas in Bagan, I can't cover them all in this article so let me just mention the main not-to-miss ones:<\/span><\/p>\n<p><strong>Shwezigon Paya:<\/strong> This is one of the most famous and most significant religious monuments in Bagan. Built in the 11th century, it served as a prototype for the construction of newer pagodas in the country and is believed to enshrine the frontal and collar bones of Buddha.<\/p>\n<p><strong>Htilominlo Pahto:<\/strong> This is an impressive red-brick Buddhist temple in Bagan. Its name comes from the king, who built it, and it was erected on the exact spot where that king was chosen to rule.<\/p>\n<p><strong>Ananda Pahto:<\/strong> This is considered as the most important temple in Bagan, thus, it is always well-preserved via constant painting and whitewashing.<\/p>\n<p><strong>Shwesandaw Paya:<\/strong> This pagoda is the second highest monument in Bagan. Because of its height, visitors like climbing it to take in the magnificent view of the Bagan plains and temples. It gets particularly crowded right before sunrise.<\/p>\n<p><strong>Dhammayangyi Pahto:<\/strong> This is a temple with a dark and dramatic past. It was built by a crazed ruler called King Narathu. Many say the king was assassinated inside this very temple so they believe it to be haunted.<\/p>\n<p><strong>Sulamani Pahto:<\/strong> This temple is a short drive from Dhammayangyi. It is frequently visited by tourists because of its sophisticated brickwork and intricate carvings. It is known as the 'crown jewel' of Bagan.<\/p>\n<p><strong>Pya-Tha-Da Paya:<\/strong> Reaching this pagoda is quite challenging and if you have awful navigational skills (like me), it will take a lot of wrong turns and u-turns. But trust me, your patience will be rewarded as this climbable pagoda is the perfect place to end a day of exploring and to catch the sunset.<\/p>\n<p>By the way, there is an entrance fee of MMK25k (valid for 5 days) for the Bagan Archaeological Zone, which pretty much covers most of the temples and pagodas.<\/p>\n<p>If you will be visiting Bagan in the coming months, expect to see lots of temples and pagodas covered in scaffoldings. This is because last 24 Aug 2016, a powerful earthquake shook Bagan, damaging hundreds of temples and pagodas. Right now, these ancient monuments are being restored by the government with the help of UNESCO. So while they are still in the process of being rebuilt, please heed the signs that ban visitors from entering at the moment and watch out for debris.<\/p>\n<h3>Accommodations<\/h3>\n<p><img class=\"alignnone size-medium\" src=\"https:\/\/static.tripzilla.com\/thumb\/d\/0\/64208_700x.jpg\" alt=\"\" width=\"700\" height=\"465\" \/><\/p>\n<p>Bagan is divided into 3 main areas -- Nyaung U, Old Bagan and New Bagan. The cheapest resorts can be found in Nyaung U while the pricier ones are in Old Bagan. Here are my recommendations for each area:<\/p>\n<p><strong>Nyaung U:<\/strong> Location-wise and price-wise, Nyaung U is the best area to stay in. And my top pick for Nyaung U is Zfreeti Hotel. There's an e-bike shop right in front of it and it's a short walk to Balloons Over Bagan's booking office and Nyaung U's 'restaurant row'. At a reasonable price, you can get a decent sized standard room with air-conditioning, free Wi-Fi and an en-suite bathroom.<\/p>\n<p><strong>New Bagan:<\/strong> If you want to stay somewhere quiet and relaxing, Bagan Lodge is the perfect choice for you. Their villas with tented roofs have all the modern amenities you could possibly need. Also, for such a luxe resort, the price isn't bad, considering you get access to outdoor pools, a jacuzzi, a gym and a spa.<\/p>\n<p><span style=\"color: #ff6600\"><em>Also read: <a style=\"color: #ff6600\" href=\"https:\/\/www.tripzilla.com\/bagan-lodge-new-bagan-myanmar\/49201\" target=\"_blank\">Step Inside: Bagan Lodge in New Bagan, Myanmar<\/a><\/em><\/span><\/p>\n<p><strong>Old Bagan:<\/strong> If you want to be surrounded by ancient temples and pagodas during your time in Bagan, book a stay in Hotel @ Tharabar Gate. While it will be pricey, you'll definitely get a one-of-a-kind experience -- personalised service, breathtaking views and luxurious rooms.<\/p>\n<h3>Restaurants<\/h3>\n<p><span style=\"font-weight: 400\">Finding good food is not at all difficult in Bagan. For a decent meal, prices range from MMK6k to MMK8k per person. Here are the restaurants I tried and became more than satisfied with:<\/span><\/p>\n<p><strong>Weather Spoon's:<\/strong> This restaurant and bar is a popular dining spot in Nyaung U's so-called 'restaurant row'. Many even claim they serve the best chicken burger in Bagan!<\/p>\n<p><strong>La Terrazza:<\/strong> I was delighted to find this Italian restaurant in Bagan. Also located in 'restaurant row', this place surprisingly makes high-quality pizzas and pastas. Their wine selection is not bad too!<\/p>\n<p><strong>Aroma 2:<\/strong> This Indian restaurant is a great hang-out place at night as it gives off a romantic vibe. Their service takes a while but their curries are authentic and savoury.<\/p>\n<p><strong>The Moon:<\/strong> This restaurant claims to be the first vegetarian restaurant in Bagan. Not sure if that's true but who cares. Their healthy dishes are tasty and guilt-free! Spot this restaurant near the Ananda Temple in Old Bagan.<\/p>\n<p><strong>7 Sisters:<\/strong> This is an open-air restaurant in New Bagan run by, you guessed it, 7 sisters. It serves Burmese, Thai, Chinese and even European dishes. The golden pork curry is really good and comes highly recommended.<\/p>\n<p><span style=\"color: #ff6600\"><em>Also read: <a style=\"color: #ff6600\" href=\"https:\/\/www.tripzilla.com\/myanmar-food-must-try\/49880\" target=\"_blank\">10 Finger Lickin’ Good Foods to Try in Myanmar<\/a><\/em><\/span><\/p>\n<h3>Souvenir Shopping<\/h3>\n<p><img class=\"alignnone\" src=\"https:\/\/static.tripzilla.com\/thumb\/b\/4\/65716_700x.jpg\" alt=\"bagan\" width=\"700\" height=\"1049\" \/><\/p>\n<p>Thankfully, Bagan has not yet turned into a crazy tourist town, unlike a bunch of cities in the world, so you can still get cheap, genuine items here, instead of just key chains and magnets. Here are my top souvenir picks for yourself -- and for your loved ones back home:<\/p>\n<p><strong>Sand paintings:<\/strong> You can find these incredibly detailed paintings being sold outside almost every temple or pagoda in Bagan. A small one can cost around MMK5k while larger ones range from MMK15k to MMK30k. I bought mine from an artist I saw painting outside one of the lesser known temples. I liked that he didn't force his paintings on me -- I hate it when vendors do that -- and happily chatted with me about his life. He didn't finish high school so I presumed this was where his main income comes from so I was more than happy to help him out. Not to mention, I adored his work.<\/p>\n<p><img class=\"alignnone size-medium\" src=\"https:\/\/static.tripzilla.com\/thumb\/b\/5\/65717_700x.jpg\" alt=\"\" width=\"700\" height=\"1049\" \/><\/p>\n<p><strong>Pathein umbrellas:<\/strong> These colourful handmade umbrellas originated from Pathein, a small area in the Ayeyarwady region of Myanmar. They are made either with cotton, silk or satin and would definitely make awesome house decors. I saw a lot of little shops selling them in 'restaurant row' in Nyaung U.<\/p>\n<p><strong>Tamarind flakes:<\/strong> I first got to try these tiny round flakes wrapped in white paper in Weather Spoon's. They're really sweet and highly addictive. You can grab a big bag of these mini snacks in simple stores or markets for only MMK1k.<\/p>\n<p>I know that gems (such as rubies) are abundant in Myanmar. But it’s very difficult to distinguish the real thing from glass. So unless you know your stones, I wouldn’t recommend buying them there, no matter how convincing the locals or tour guides are at saying they’re genuine.<\/p>\n<h3>Departure Tax<\/h3>\n<p><span style=\"font-weight: 400\">Myanmar increased their international departure tax for flights last 1 July 2016. From USD15, it is now USD20. The departure tax is usually included when you purchase your air ticket. However, for tickets bought before `1 April 2016 for travel from 1 July 2016 onwards, passengers will have to pay the difference (USD5) upon check-in at the airport. You can only pay in cash (USD or MMK). Credit card or debit card payments won't be accepted.<\/span><\/p>\n<p><span style=\"color: #ff6600\"><em>Also read: <a style=\"color: #ff6600\" href=\"https:\/\/www.tripzilla.com\/majestic-bagan-sunrise-sunset\/292\" target=\"_blank\">Majestic Bagan from Sunrise to Sunset<\/a><\/em><\/span><\/p>\n<p><em><strong>Disclaimer:<\/strong> Myanmar is a rapidly changing and developing country so the prices indicated here are as of 2 Nov 2016 and are subject to change. As of the time I spent in Bagan, 1 USD = 1,300 MMK. So remember to always double-check the information provided here before travelling to avoid disappointment.<\/em><\/p>\n"},{"id":49880,"thumbnail":"https:\/\/www.tripzilla.com\/wp-content\/uploads\/2016\/11\/Tea-and-some-irresistable-snacks_Fotor.jpg","title":"10 Finger Lickin' Good Foods to Try in Myanmar","url":"https:\/\/www.tripzilla.com\/myanmar-food-must-try\/49880","publish_at":"2016-11-28 14:00:36","description":"You don't know what you're missing out in Myanmar until you try these delicious foods, drinks and desserts. ","postslug":"myanmar-food-must-try","author":"thesailingbee (by Aditi Mittal)","author_avatar_url":{"0":"https:\/\/www.tripzilla.com\/wp-content\/uploads\/2016\/11\/Aditi-M-150x150.jpg"},"category":["Myanmar","Shopping &amp; Eating"],"tag":[],"custom_seo_title":null,"custom_seo_description":null,"og_title":null,"og_image":null,"og_des":null,"content":"<p><span style=\"font-weight: 400\">Influenced by the overlapping tastes of the 100 ethnic groups that call the country home and the five countries that share its borders, Myanmar’s cuisine is simple but superbly diverse. <\/span><\/p>\n<p><span style=\"font-weight: 400\">While it is easy to lazily draw the conclusion that some of more well-known Burmese dishes are similar to those found in neighbouring India or China, the Burmese have infused their own flavours and serving style that make these dishes very much their own. <\/span><\/p>\n<p><span style=\"font-weight: 400\">Let’s take a culinary journey through some of the best food that the country has to offer which will not only whet your appetite but also leave you wondering “<\/span><i><span style=\"font-weight: 400\">why haven’t I tried that yet and why can’t I find it where I live?”<\/span><\/i><\/p>\n<h3><b>1. Ngar Hta Min<\/b><\/h3>\n<p><img src=\"https:\/\/static.tripzilla.com\/thumb\/7\/8\/65400_700x.jpg\" \/><span style=\"font-size: 8pt\"><em>Image credit<span style=\"font-weight: 400\">:<\/span><a href=\"https:\/\/theburmalicious.com\/2016\/01\/14\/kneaded-fish-rice-ngar-htamin-nal\/\"> <span style=\"font-weight: 400\">theburmalicious<\/span><\/a><\/em><\/span><\/p>\n<p>A brilliant dish from the Shan region, Ngar Hta Min is a delicious fish-tomato rice or fish-rice cake – a comfort food best suited for rainy evenings or cold nights in the hills. It’s a simple dish prepared by making small round balls from a mixture of pre-cooked tomato, fish, rice and potatoes together, and garlic, chilli and fish oil for flavour.<\/p>\n<h3><b>2. Tea and Snacks<\/b><\/h3>\n<p><img src=\"https:\/\/static.tripzilla.com\/thumb\/8\/0\/65408_700x.jpg\" \/><\/p>\n<p><span style=\"font-weight: 400\">Burmese take their tea very seriously. A cup of black tea is sweetened with condensed milk to make it richer. It can be enjoyed all day long at tea stalls along most roads, and if you’re not into milky tea, Chinese green tea is also available. And the tea doesn’t come alone – any decent tea stall will have a gamut of snacks – flatbread sprinkled with sugar, fried pakoras, fritters, fried bread sticks, <\/span><i><span style=\"font-weight: 400\">Buthi Kyaw<\/span><\/i><span style=\"font-weight: 400\"> (bottle gourd pieces, batter fried) and others – served to you with the tea. You pay for only what you eat but the idea is to present the temptation and before you know it, you’re through half the selection. <\/span><\/p>\n<h3><b>3. Mont Lin Ma Yar<\/b><\/h3>\n<p><img src=\"https:\/\/static.tripzilla.com\/thumb\/7\/d\/65405_700x.jpg\" \/><span style=\"font-size: 8pt\"><i><span style=\"font-weight: 400\">Image credit: <\/span><\/i><i><span style=\"font-weight: 400\"><a href=\"https:\/\/www.flickr.com\/photos\/alexschwab\/8174746595\/in\/photolist-qPKR1n-dsnHmP-ko65rL-ko4Bev-9MuMhR-ffWuGt-dvdHBY-fC4nzM-69Myyd-6fZZ9A-6fVNMH-6fVQFM-6g15Hq-6fVKbx-6fZXYQ-6fZVqw-6g157y-6fWqCT-6fVRYv-6fVPnB-cmHqA1-cmHqLA-69HkFB-6g1dVJ-6fZTwm-iFZoF-9\">Alex Schwab<\/a><\/span><\/i><\/span><\/p>\n<p><span style=\"font-weight: 400\">Within the same category as above but sold independently is a gorgeous looking snack <\/span><i><span style=\"font-weight: 400\">Mont Lin Ma Yar<\/span><\/i><span style=\"font-weight: 400\"> - informally called the ‘husband and wife snack’. While walking in downtown Yangon, you’ll come across many hawkers selling these golden muffins. They are made with rice flour batter in a special iron mould. The batter is divided into two sections – the first half contains only batter and the second half is topped with quail egg and roasted chickpeas. Both the halves, the \"Yin and the Yang\", are then joined together to create the Mont Lin Ma Yar.<\/span><\/p>\n<h3><b>4. Shwe Yin Aye<\/b><\/h3>\n<p><i><span style=\"font-weight: 400\"><img src=\"https:\/\/static.tripzilla.com\/thumb\/7\/9\/65401_700x.jpg\" \/><span style=\"font-size: 8pt\">Image credit: <\/span><\/span><\/i><span style=\"font-size: 8pt\"><i><span style=\"font-weight: 400\"><a href=\"http:\/\/orig14.deviantart.net\/c045\/f\/2011\/253\/7\/3\/sweet_dessert_or_shwe_yin_aye_by_crazyspiritsss-d49fbp0.jpg\" target=\"_blank\">deviantart<\/a><\/span><\/i><\/span><\/p>\n<p><span style=\"font-weight: 400\">On a hot day in Myanmar, an iced dessert cannot be too far from your thoughts. Shwe Yin Aye is similar to <em>Chendol<\/em> from Indonesia and is prepared with steamed sticky rice, coconut milk jelly, tapioca seeds, coconut milk, sugar, bread and ice. You can eat this dessert with different combinations of seaweed, agar-agar, palm sugar, etc.<\/span><\/p>\n<h3><b>5. Myanmar Curry-Rice meal<\/b><\/h3>\n<p><span style=\"font-weight: 400\">The local set-meal is not just comfort food but an experience in itself. It comes with a slightly oily curry (choose from chicken, fish, mutton, beef, vegetable or pork), rice, a bowl of lentil soup and six vegetable side dishes (expect to find potatoes, pumpkin, okra, broad beans, leafy vegetables, tomato salad, etc.) and a garlic chili dip. The variety of side dishes and spice levels may differ from place to place but this culinary experience remains the same.<\/span><\/p>\n<p><img src=\"https:\/\/static.tripzilla.com\/thumb\/8\/1\/65409_700x.jpg\" \/><span style=\"font-size: 8pt\"><i><span style=\"font-weight: 400\">Image credit: <\/span><\/i><a href=\"https:\/\/www.flickr.com\/photos\/slapers\/11820194483\/in\/photolist-j1vA1B-pZkrnC-dMReuT-bgHmvM-nruB7t-iPq8nf-iWjtQB-CVZW68-d6QqdE-wAr9To-9DVf6y-azyoxV-bgHkVB-dBqbYw-iKvHCb-qgU3se-FDDYmq-nSunCs-CMxaKL-fkqoYF-mHQzpi-copMjJ-jQiw5B-dZrRGd-e9sfPL-pZsDJP-9D\"><i><span style=\"font-weight: 400\">Paul Arps<\/span><\/i><\/a><\/span><\/p>\n<p><span style=\"font-weight: 400\">And this costs just S$4-5 – what more could you ask for? <\/span><\/p>\n<p><i><span style=\"font-weight: 400\">Tips: The best set-meal I had in Myanmar was at Ma Mae Ning restaurant in Bagan. It is run by a Burmese family who takes pride in displaying their family portrait with Aung San Suu Kyi, who once visited their restaurant. Another great place to try the local meal is at Bamboo Forest Restaurant at Inle Lake. The place is slightly expensive but a great halt in the middle of a demanding Inle Lake tour.<\/span><\/i><\/p>\n<h3><b>6. Mohinga<\/b><\/h3>\n<p><span style=\"font-weight: 400\"><img src=\"https:\/\/static.tripzilla.com\/thumb\/7\/c\/65404_700x.jpg\" \/><span style=\"font-size: 8pt\"><em>Image credit: <a href=\"https:\/\/www.flickr.com\/photos\/kajisagook\/7944917574\/in\/photolist-e8YJfN-fC4nzM-98r9MW-fhcS96-i7s1e7-i79zNi-n65i8z-hgyPqy-nbXCTC-d743ww-iPRe9z-hgYt3y-jnHdvd-ne3pW1-gYrU1m-ne3q57-i7s9hU-eu2rhG-d73KQQ-eu2rCw-kXpXk-dWe9MD-fcMJfN-mNPTxe-hgYf1k-d74Mcu-e\">Kaj17<\/a><\/em><\/span><\/span><\/p>\n<p><span style=\"font-weight: 400\">A savoury fish noodle soup which is indisputably the ultimate breakfast dish of the country. A fish flavoured rice noodle soup, it is delicious and available almost everywhere in Myanmar. <\/span><\/p>\n<p>A word of caution here, though, it is a fish soup in its true sense – cooked with fish, fish paste and fish sauce. If the smell of fish bothers you, clip your nose and but do have it.<\/p>\n<h3><b>7. Sanwin Makin<\/b><\/h3>\n<p><img src=\"https:\/\/static.tripzilla.com\/thumb\/7\/7\/65399_700x.jpg\" \/><span style=\"font-size: 8pt\"><i><span style=\"font-weight: 400\">Image credit: <\/span><\/i><i><span style=\"font-weight: 400\"><a href=\"http:\/\/whenmysoupcamealive.blogspot.sg\/2014\/09\/sanwin-makin-little-bit-of-burma.html\">whenmysoupcamealive<\/a><\/span><\/i><\/span><\/p>\n<p><span style=\"font-weight: 400\">A traditional Burmese sweet which draws its inspiration from Indian semolina desserts, these cakes are common treats available on the street. In addition to semolina, coconut milk\/cream, egg, cardamom and sugar also go into preparing these cakes which are then topped off with a sprinkling of poppy seeds.<\/span><\/p>\n<h3><b>8. Shan Noodle Soup\/Salad<\/b><\/h3>\n<p><span style=\"font-weight: 400\"><img src=\"https:\/\/static.tripzilla.com\/thumb\/8\/2\/65410_700x.jpg\" \/><\/span><\/p>\n<p><span style=\"font-weight: 400\">More popular in the Shan region, it consists of flat rice noodles in a flavoursome broth with shredded chicken or pork, a sprinkling of toasted sesame with garlic oil and pickled vegetables on the side. It is served more in the boat noodles (a popular Thai dish) tradition – serving size is small and probably good for a snack. But it is a snack that is deliciously addictive, so don’t be alarmed if you end up having 3-4 bowls or more. It is also served without soup like a salad.<\/span><\/p>\n<p><span style=\"font-weight: 400\">Better to arrive at these shops early enough as this dish is eaten more as a breakfast or snack item and the popular shops run out of it by the evening.<\/span><\/p>\n<p><i><span style=\"font-weight: 400\">Tips: I am yet to discover the worst place to not to have this dish. The best place I had these noodles was at a small kiosk run by a woman in the alleys of the main market in Kalaw. The other places to grab a great bowl is at 999 Shan Noodle House in Yangon and Pyae Pyae in Kalaw.<\/span><\/i><\/p>\n<h3><b>9. Burmese Salads<\/b><\/h3>\n<p><span style=\"font-weight: 400\">The food in Myanmar is often unassuming. Some dishes may not look like much but are indeed delicious. Among these is the whole range of Thoke (salad in Burmese) – simple but delightful, and super healthy to boot.<\/span><\/p>\n<p><img src=\"https:\/\/static.tripzilla.com\/thumb\/7\/f\/65407_700x.jpg\" \/><\/p>\n<p><span style=\"font-weight: 400\">The most common salad you’ll find is tomato-peanut salad followed closely by <\/span><i><span style=\"font-weight: 400\">Lephet Thoke<\/span><\/i><span style=\"font-weight: 400\"> or pickled tea leaf salad which is probably more well known outside of Myanmar.<\/span><\/p>\n<p><img src=\"https:\/\/static.tripzilla.com\/thumb\/7\/a\/65402_700x.jpg\" \/><span style=\"font-size: 8pt\"><i><span style=\"font-weight: 400\">Image credit: <\/span><\/i><a href=\"https:\/\/commons.wikimedia.org\/wiki\/File:Laphet_thoke.JPG#filelinks\"><i><span style=\"font-weight: 400\">Hintha<\/span><\/i><\/a><\/span><\/p>\n<p><span style=\"font-weight: 400\">Other Thoke include <\/span><i><span style=\"font-weight: 400\">Gin Thoke,<\/span><\/i><span style=\"font-weight: 400\"> or ginger salad, which consists of shredded ginger and cabbage, toasted chickpea powder, yellow lentils, peanuts, and lots of lime; <\/span><i><span style=\"font-weight: 400\">Myin Kwa Yuet Thoke <\/span><\/i><span style=\"font-weight: 400\">which combines pennywort leaves, tomato, peanut, garlic and lime juice; and <em>Shan Tofu Thoke<\/em> (tofu here is a misnomer) which is made of chickpea puree with a consistency of tofu. Probably the simplest of all is a salad of sprouted whole yellow peas with chopped tomatoes and onions with a dash of lemon. Interesting, huh!<\/span><\/p>\n<h3><b>10. Burmese Yoghurt drink<\/b><\/h3>\n<p><span style=\"font-weight: 400\">This refreshing glass of sweet blended yoghurt can be a very effective cooling agent when the Burmese heat becomes unbearable. Quite similar to Indian<\/span><i><span style=\"font-weight: 400\"> Lassi<\/span><\/i><span style=\"font-weight: 400\">, Burmese have their own version of this drink where the sugar is replaced by palm sugar syrup. Don’t be afraid to try some add-ons like chocolate fudge, sticky rice or coconut shreds which add to the experience.<\/span><\/p>\n<p><img src=\"https:\/\/static.tripzilla.com\/thumb\/8\/4\/65412_700x.jpg\" \/><\/p>\n<p><i><span style=\"font-weight: 400\"><img src=\"https:\/\/static.tripzilla.com\/thumb\/7\/e\/65406_700x.jpg\" \/><\/span><\/i><\/p>\n<p><span style=\"font-weight: 400\">Beware! the base level of sugar is quite saccharine. Ask the vendor to go easy on the syrup if you are not into super-sweet.<\/span><\/p>\n<p><span style=\"font-weight: 400\">Next time anyone tells you that Myanmar cuisine is similar to India or China, take them along to explore the cuisine with a fresh perspective.<\/span><\/p>\n<p><span style=\"color: #ff6600\"><em>Also Read: <a style=\"color: #ff6600\" href=\"https:\/\/www.tripzilla.com\/myanmar-must-have-experiences\/49292\" target=\"_blank\">7 Must-Have Experiences in Myanmar for First-Time Travellers<\/a><\/em><\/span><\/p>\n"},{"id":49292,"thumbnail":"https:\/\/www.tripzilla.com\/wp-content\/uploads\/2016\/11\/bagan-1137015_1280.jpg","title":"7 Must-Have Experiences in Myanmar for First-Time Travellers","url":"https:\/\/www.tripzilla.com\/myanmar-must-have-experiences\/49292","publish_at":"2016-11-22 14:00:30","description":"From hot-air ballooning in Bagan to taking on the Kalaw-Inle Lake trek, these are the must-have experiences in Myanmar! ","postslug":"myanmar-must-have-experiences","author":"thesailingbee (by Aditi Mittal)","author_avatar_url":{"0":"https:\/\/www.tripzilla.com\/wp-content\/uploads\/2016\/11\/Aditi-M-150x150.jpg"},"category":["Myanmar","Trip Planning"],"tag":[],"custom_seo_title":null,"custom_seo_description":null,"og_title":null,"og_image":null,"og_des":null,"content":"<p>After years of isolation, Myanmar (formerly known as Burma) is slowly making its mark on bucket lists far and wide. The country, of course, has much to offer the keen traveller – the general nonchalance of the locals towards foreigners, an unspoilt culture, countless pagodas and the thrill of exploring the unknown – making Myanmar an unbeatable destination this year.<\/p>\n<p><span style=\"font-weight: 400\">If you are travelling for the first time to Myanmar, here is a list of 7 must-have experiences in the country:<\/span><\/p>\n<h3><b>1. Get a bird’s eye view of Bagan temples<\/b><\/h3>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/c\/9\/64969_700x.jpg\" alt=\"\" width=\"700\" height=\"466\" \/><\/p>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/c\/a\/64970_700x.jpg\" alt=\"\" width=\"700\" height=\"466\" \/><\/p>\n<p><span style=\"font-weight: 400\">Hot air ballooning over Bagan can easily be the highlight of your trip. While on the ground it is impossible to imagine the spread of the ancient temples across the small town of Bagan, but at a height of 10,000 ft. you get to witness the awe-inspiring view of the temples across the Bagan plains with the majestic Irrawaddy River running alongside.<\/span><\/p>\n<p><span style=\"font-weight: 400\">There are three main operators in Bagan – Golden Eagle, Balloons Over Bagan and Oriental Ballooning. The whole affair starts before daybreak and is roughly 3.5 hours long, of which you will be in the air for around 45–60 mins. The hot air ballooning runs from April to October and costs around US$290 to US$320 (Pretty affordable, ha!).  On a serious note, if you have the means and time, then it is a once-in-a-lifetime experience. <\/span><\/p>\n<p><i><span style=\"font-weight: 400\">Tips: <\/span><\/i><\/p>\n<ul>\n<li><i><span style=\"font-weight: 400\">I flew with Oriental Ballooning and found them to be highly professional. Book through a local travel agent to get a better deal. <\/span><\/i><\/li>\n<li><i><span style=\"font-weight: 400\">Book well in advance as they are fully booked most of the time.<\/span><\/i><\/li>\n<li><i><span style=\"font-weight: 400\">If you have the luxury of time, check with the ballooning company on wind conditions before scheduling – it can be a dull day if there is no\/little wind.<\/span><\/i><\/li>\n<\/ul>\n<h3><b>2. Sail away from Mandalay to Bagan (or from Bagan to Mandalay)<\/b><\/h3>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/6\/3\/64355_700x.jpg\" alt=\"\" width=\"700\" height=\"526\" \/><\/p>\n<p><span style=\"font-weight: 400\">Slow travel is the way to soak in this country. If you are on the fence about signing up for this experience, ask yourself when you will get the chance to be in Burma next and get to sail down the mighty Irrawaddy. Take out some time from your packed sightseeing schedule to take this trip. Get hold of <\/span><i><span style=\"font-weight: 400\">Burmese Days<\/span><\/i><span style=\"font-weight: 400\"> and\/or <\/span><i><span style=\"font-weight: 400\">The Glass Palace (or whatever catches your fancy)<\/span><\/i><span style=\"font-weight: 400\">, get a beer, put your feet up and relax as the boat gently makes it way along the river.<\/span><\/p>\n<p><span style=\"font-weight: 400\">The boat from Mandalay leaves early in the morning around 7am and reaches Bagan at 4pm. Yes, it is 10-hour long journey. Mind you, these are the express boats! The tickets can be booked easily through any hotel or local travel agent. The one-way journey costs around US$42 which includes breakfast, lunch, and refreshments (beer is also available for sale). The fabulous views of Sagaing Hill on leaving Mandalay and ruins of temples on reaching Bagan are excellent photo opportunities. <\/span><\/p>\n<p><i><span style=\"font-weight: 400\">Tips: <\/span><\/i><\/p>\n<ul>\n<li><i><span style=\"font-weight: 400\">You can ask your hotel to pack breakfast for you (the food provided on the boat does not suffice. <\/span><\/i><\/li>\n<li><i><span style=\"font-weight: 400\">Only about 60% of the seats are shaded. Try to reach the jetty early to get the shaded seats. <\/span><\/i><\/li>\n<li><i><span style=\"font-weight: 400\">It is a hot country.  Wear comfortable clothes, do not forget your sun-glasses, hat, sun block and of course, mosquito repellant.<\/span><\/i><\/li>\n<\/ul>\n<h3><b>3. Indulge in the healthy street food<\/b><\/h3>\n<p><span style=\"font-size: 8pt\"><em><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/d\/1\/64977_700x.jpg\" alt=\"\" width=\"700\" height=\"492\" \/>Image credit: <a href=\"https:\/\/www.flickr.com\/photos\/globaltrotters\/7631479920\/in\/photolist-dvdHBY-7Bv9oV-e6aZK7-LQcxnm-LzG6AW-dQSwQ7-jxwiyS-DzCQMZ-LQg2er-cCnk71\" target=\"_blank\">Fighting Irish 1977<\/a><\/em><\/span><\/p>\n<p><span style=\"font-weight: 400\">Street food? Healthy? Get ready to be impressed by the variety of salads eaten in this country. No, the tea leaf salad is not the only salad that the people eat here. Expect anything and everything from avocado to tomato peanut to watercress – there are like a hundred versions of salads that you’ll get to see while walking on the road. Don’t shy away from trying one yourself. They are delicious too!<\/span><\/p>\n<h3><b>4. Celebrate the festival of Thadingyut with the locals<\/b><\/h3>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/6\/2\/64354_700x.jpg\" alt=\"\" width=\"700\" height=\"526\" \/><\/p>\n<p><span style=\"font-weight: 400\">Consider yourself lucky if you arrive in Myanmar during Thadingyut festival. It falls on the full moon night of the seventh month of the Burmese calendar, which is the end of Buddhist lent. It is a public holiday so expect the markets to be shut. The festival is celebrated with lights and firecrackers, and locals can be seen lighting candles outside their homes and temples. <\/span><\/p>\n<p><span style=\"font-weight: 400\">Doesn’t matter which city you are in, any big temple such as Shwedagon in Yangon, Su Taung Pyi Pagoda in Mandalay or Shwezigon Pagoda in Bagan, will have the same exuberance and ambience. By dusk, the whole nation is shining in festive glory. The energy during the festival is so high that soon you’ll be immersed in sharing the joy with the locals. In Mandalay, a street market serving a vast variety of street food comes up just below the temples near the palace compound.<\/span><\/p>\n<h3><b>5. Take a break for tea-time<\/b><\/h3>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/d\/0\/64976_700x.jpg\" alt=\"\" width=\"700\" height=\"465\" \/><span style=\"font-size: 8pt\"><em>Image credit: <a class=\"owner-name truncate\" title=\"Go to Emilio Labrador's photostream\" href=\"https:\/\/www.flickr.com\/photos\/3059349393\/\" target=\"_blank\">Emilio Labrador<\/a><\/em><\/span><\/p>\n<p><span style=\"font-weight: 400\">Myanmar is a tea drinking country. Don’t be surprised to see people drinking tea at roadside tea-stalls all the time.  Mornings in downtown Yangon get lively when road side tea stalls begin to set up, selling vivid snacks with tea. For a foreigner, this is the best way to blend in the Burmese lifestyle, interact with locals and observe the daily lives of people.<\/span><\/p>\n<h3><b>6. Experience the local life on Kalaw-Inle Lake trek<\/b><\/h3>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/c\/d\/64973_700x.jpg\" alt=\"\" width=\"700\" height=\"466\" \/><\/p>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/c\/c\/64972_700x.jpg\" alt=\"\" width=\"700\" height=\"466\" \/><\/p>\n<p><span style=\"font-weight: 400\">A colonial hill town, Kalaw, is an excellent spot to get respite from the scorching sun. It is a great place to begin the trek to Inle Lake which is around 70 km. If relishing nature, interacting with locals and experiencing the village life is your style of travelling, then this is definitely what you should be doing in Myanmar.<\/span><\/p>\n<p><span style=\"font-weight: 400\">There is a bevy of local travel agents in the town who you can book you for the trek easily. For a group tour, it costs around US$13 per person and more for a private tour. The trek is generally done over 3 days and 2 nights but special arrangements can be made if you have less time. You will be accompanied by a local English-speaking guide who will educate you about the local lifestyle. The tour ends with the boat ride on the quaint Inle Lake.<\/span><\/p>\n<p><i><span style=\"font-weight: 400\">Tips: <\/span><\/i><\/p>\n<ul>\n<li><i><span style=\"font-weight: 400\">It can be a strenuous activity, if you are in the mood for a stress-free holiday, then keep it for the next time.<\/span><\/i><\/li>\n<\/ul>\n<h3><b>7. Capture the best of Myanmar<\/b><\/h3>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/c\/b\/64971_700x.jpg\" alt=\"\" width=\"700\" height=\"466\" \/><\/p>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/c\/f\/64975_700x.jpg\" alt=\"\" width=\"700\" height=\"468\" \/><\/p>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/c\/e\/64974_700x.jpg\" alt=\"\" width=\"700\" height=\"466\" \/><\/p>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/5\/d\/64349_700x.jpg\" alt=\"\" width=\"700\" height=\"526\" \/><\/p>\n<p><span style=\"font-weight: 400\">Myanmar is the indisputable photographer’s paradise. Each destination in the country has its own charm – climb a tall pagoda in Bagan to capture the vivid hues of the sky during the sunrise\/sunset; if portrait is your forte then the monks in red robes would definitely catch your attention; or you may like to stroll around downtown Yangon to capture its colonial past.<\/span><\/p>\n<p><span style=\"color: #ff6600\"><em>Also Read: <a style=\"color: #ff6600\" href=\"https:\/\/www.tripzilla.com\/myanmar-travel-guide-one-week\/47786\" target=\"_blank\">One-Week in Myanmar: Travel Guide with Tips &amp; Costs<\/a><\/em><\/span><\/p>\n<p><span style=\"font-weight: 400\">This is, of course, not an exhaustive list of experiences to indulge in while in Myanmar. A large country at the crossroads of many cultures and influences, Myanmar has a variety of things-to-do which are still waiting to be discovered. The volume of tourists visiting the country is growing rapidly, but the country and culture are still pristine. Undoubtedly, this is the best time to visit the country and make the experience your own. <\/span><\/p>\n"},{"id":49201,"thumbnail":"https:\/\/www.tripzilla.com\/wp-content\/uploads\/2016\/11\/1-7.jpg","title":"Step Inside: Bagan Lodge in New Bagan, Myanmar","url":"https:\/\/www.tripzilla.com\/bagan-lodge-new-bagan-myanmar\/49201","publish_at":"2016-11-18 08:00:14","description":"If you are looking for a dose of luxury in the ancient temple town of Bagan, this lodge has your name on it.","postslug":"bagan-lodge-new-bagan-myanmar","author":"Catherine Mirasol","author_avatar_url":{"0":"https:\/\/secure.gravatar.com\/avatar\/0d43c7d982dae6ee4e0059a73b3d2579?s=150&d=mm&r=g"},"category":["Bagan","Myanmar","PH","Stays"],"tag":[],"custom_seo_title":null,"custom_seo_description":null,"og_title":null,"og_image":null,"og_des":null,"content":"<p><span style=\"font-weight: 400\">One of the highlights of my trip to Bagan, Myanmar was definitely my stay at Bagan Lodge. It gave me just the right dose of luxury amidst the ruggedness that I experienced whilst exploring the ancient temple town.<\/span><\/p>\n<p><span style=\"color: #ff6600\"><em>Also read: <a style=\"color: #ff6600\" href=\"https:\/\/www.tripzilla.com\/myanmar-safe-travel\/47950\" target=\"_blank\">Is It Really Safe to Travel to Myanmar?<\/a><\/em><\/span><\/p>\n<p><img class=\"alignnone\" src=\"https:\/\/static.tripzilla.com\/thumb\/d\/0\/64208_700x.jpg\" alt=\"bagan lodge\" width=\"700\" height=\"465\" \/><\/p>\n<h3>About Bagan Lodge<\/h3>\n<p><span style=\"font-weight: 400\">Bagan Lodge is situated at the edge of the Bagan archaeological realm, giving guests easy access to the 2,000+ still-standing temples, stupas and pagodas that dot the town's vast landscape while also providing them with a relaxing and romantic oasis after a long day of traipsing around some of the most magnificent world wonders.<\/span><\/p>\n<p><img class=\"alignnone size-medium\" src=\"https:\/\/static.tripzilla.com\/thumb\/d\/1\/64209_700x.jpg\" alt=\"\" width=\"700\" height=\"466\" \/><\/p>\n<p><img class=\"alignnone size-medium\" src=\"https:\/\/static.tripzilla.com\/thumb\/d\/2\/64210_700x.jpg\" alt=\"\" width=\"700\" height=\"465\" \/><\/p>\n<h3>Accommodation<\/h3>\n<p><img class=\"alignnone size-medium\" src=\"https:\/\/static.tripzilla.com\/thumb\/d\/3\/64211_700x.jpg\" alt=\"\" width=\"700\" height=\"465\" \/><\/p>\n<p><span style=\"font-weight: 400\">The resort features 82 villas and 4 suites, all furnished with a tasteful mix of old world Burmese and contemporary decors and each decked out with a private veranda. The amenities are high-class too -- as if you'd expect anything less! Each room is equipped with full-blast air-conditioning, hot showers, a huge bathtub, soft bathrobes, fast Wi-Fi, a fully stacked mini bar, cable TV and comfy beds.<\/span><\/p>\n<h3>Dining<\/h3>\n<p><img class=\"alignnone size-medium\" src=\"https:\/\/static.tripzilla.com\/thumb\/d\/4\/64212_700x.jpg\" alt=\"\" width=\"700\" height=\"1051\" \/><\/p>\n<p><span style=\"font-weight: 400\">You'll be spoilt for choice in this posh resort. There's a main restaurant called Tiffin Box. It's an open-air restaurant that serves a variety of cuisines -- from Burmese to Thai to Western. Aside from that, there's The Lobby Lounge Bar, which is located near the resort's entrance. It's great for a quick cup of coffee or tea. And finally, you have The Pool Bar, which is perfect for grabbing a Happy Hour cocktail in between pool or jacuzzi sessions.<\/span><\/p>\n<p><span style=\"color: #ff6600\"><em>Also read: <a style=\"color: #ff6600\" href=\"https:\/\/www.tripzilla.com\/majestic-bagan-sunrise-sunset\/292\" target=\"_blank\">Majestic Bagan from Sunrise to Sunset<\/a><\/em><\/span><\/p>\n<h3>Recreation<\/h3>\n<p><img class=\"alignnone size-medium\" src=\"https:\/\/static.tripzilla.com\/thumb\/d\/5\/64213_700x.jpg\" alt=\"\" width=\"700\" height=\"466\" \/><\/p>\n<p><span style=\"font-weight: 400\">Of course, you can't come to Bagan without checking out the temples! And the resort staff are all very eager to help you book day tours to the famous ones or to rent out one of their well-maintained e-bikes if you prefer a do-it-yourself tour.<\/span><\/p>\n<p><span style=\"font-weight: 400\">After a full day of sightseeing, I bet you'll need a bit of downtime to rest and recharge. You can pamper yourself at The Spa, which has an extensive list of massage treatments. Another way to stretch those weary muscles is by going for a dip in one of the swimming pools (There's two!) or jacuzzi. And if you're a gym nut and <\/span><i><span style=\"font-weight: 400\">must<\/span><\/i><span style=\"font-weight: 400\"> exercise even while on vacation, there's the Fitness Centre, which is equipped with all the basic gym facilities.<\/span><\/p>\n<p><img class=\"alignnone size-medium\" src=\"https:\/\/static.tripzilla.com\/thumb\/d\/6\/64214_700x.jpg\" alt=\"\" width=\"700\" height=\"466\" \/><\/p>\n<p><span style=\"font-weight: 400\">To check the rates and promos being offered by Bagan Lodge, visit their official <\/span><a href=\"http:\/\/bagan-lodge.com\/\" target=\"_blank\"><span style=\"font-weight: 400\">website<\/span><\/a><span style=\"font-weight: 400\">. For payments, the resort accepts Visa and MasterCard when it comes to cards and Burmese kyats (MMK) and crisp US dollars (USD) when it comes to cash. ATM machines can be found inside the resort. Though, please note that the maximum amount per withdrawal is MMK300,000 (around USD200) and that the maximum amount per day is MMK1,000,000 (around USD700).<\/span><\/p>\n<p><img class=\"alignnone size-medium\" src=\"https:\/\/static.tripzilla.com\/thumb\/d\/7\/64215_700x.jpg\" alt=\"bagan lodge myanmar\" width=\"700\" height=\"1053\" \/><\/p>\n<p><span style=\"font-weight: 400\">I had a truly wonderful experience at this resort so I hope you get a chance to stay here too!<\/span><\/p>\n<p><span style=\"color: #ff6600\"><em>Also read: <a style=\"color: #ff6600\" href=\"https:\/\/www.tripzilla.com\/silkair-mandalay-bagan-myanmar\/8015\" target=\"_blank\">Baring My Soles in Bagan, Myanmar<\/a><\/em><\/span><\/p>\n"},{"id":47950,"thumbnail":"https:\/\/www.tripzilla.com\/wp-content\/uploads\/2016\/11\/myanmar-travel-safe.jpg","title":"Is It Really Safe to Travel to Myanmar?","url":"https:\/\/www.tripzilla.com\/myanmar-safe-travel\/47950","publish_at":"2016-11-04 09:00:35","description":"Is it SAFE to travel to Myanmar? This Filipina traveller shares her personal take on the issue.","postslug":"myanmar-safe-travel","author":"Ferna Mae Fernandez","author_avatar_url":{"0":"https:\/\/www.tripzilla.com\/wp-content\/uploads\/2016\/10\/Ferna-Mae-Fernandez-150x150.jpg"},"category":["Myanmar","PH","Travel Inspiration","Travel Stories"],"tag":[],"custom_seo_title":null,"custom_seo_description":null,"og_title":null,"og_image":null,"og_des":null,"content":"<p><em>Contributed by <a href=\"http:\/\/www.everywherewithferna.com\/\" target=\"_blank\">Everywhere with Ferna<\/a><\/em><\/p>\n<p>I was asked not only once but countless of times if travelling to Myanmar is really safe. I figured it's time for me to write my personal thoughts about this based on my travel experience there. Prior to my visit, I was actually asked by both my online and offline friends, if the safety of the country has been my concern to travel to Myanmar and questioned why I feel so convinced to be in this place. I certainly had no idea if Myanmar is really safe, what I had at the time was a strong desire to be in this country.<\/p>\n<p><span style=\"color: #ff6600\"><em>Also read: <a style=\"color: #ff6600\" href=\"https:\/\/www.tripzilla.com\/everything-travellers-need-to-know-before-visiting-myanmar\/24273\" target=\"_blank\">Everything Travellers Need to Know Before Visiting Myanmar<\/a><\/em><\/span><\/p>\n<p>Is travelling to Myanmar safe? YES! Even for solo travellers. I went there all by myself for 10 days with limited knowledge about the country. Luckily, Eishel, a Filipino, who works as an English teacher at Mae Sot Thailand came to rescue me the night before I departed from Thailand to Myanmar. She also went solo to these golden kingdom months ago. I will forever thank her for giving me ideas and tips.<\/p>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/b\/d\/63677_1247x697.jpg\" alt=\"\" width=\"1247\" height=\"697\" \/><\/p>\n<p>In my experience, the time I arrived in Myawaddy border after crossing the bridge from Mae Sot Thailand, I was warmly welcomed by the immigration officers who were all men in a tiny room. They actually are kind enough, spoke their own language which was translated to me by the only English speaker in the room. They were able to joke about my wrist watch and inquired if I teach English as they are eager to learn the language. While they’re processing my entry, I confidently asked them if it’s safe for me to travel the country. Without a doubt, they said “YES”, giving me words of wisdom and assurance to not be afraid because people are willing to help whenever I need some. It was a relief for me hearing those words from them.<\/p>\n<p><span style=\"color: #ff6600\"><em>Also read: <a style=\"color: #ff6600\" href=\"https:\/\/www.tripzilla.com\/exotic-travel-not-dangerous\/40533\" target=\"_blank\">“Exotic Travel” Does Not Mean “Dangerous Travel”<\/a><\/em><\/span><\/p>\n<p>When they finally stamped my passport, the English speaker officer showed me the way out and explained what is there to see, shared what options to take for money exchange, pointed where to take the “shared taxi” to Hpa-an and advised me for the exact amount of the fare. That first encounter with Burmese people was an impression that made me feel really good.<\/p>\n<h3>Why do I say it’s SAFE?<\/h3>\n<p>My experience might be different from other travellers who visited the country. I didn’t hear any horror stories by the time I was there (except those who were food poisoned, is this considered as horror? More story later) so, if there is, I hope they are fine now. In my observation, the places where I went to (Myawaddy, Hpa-an, Inle Lake, Bagan, and Yangon) are totally safe.<\/p>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/b\/e\/63678_1140x656.jpg\" alt=\"\" width=\"1140\" height=\"656\" \/><\/p>\n<p>The Burmese are the friendliest people I've met. They interact positively without asking in return, but thanking me wholeheartedly that I visited their country. I am an Asian with almost the same feature as a Burmese, yet, visible enough to be tagged as a tourist. They love to share what they have (just like Filipinos) from food, drinks and checked if I need anything else. Despite the fact that we speak different languages, they’ve been longing to learn the English words. They love hearing my accent, and curious how I created sentences so well (Oops! I’m not perfect, but, I’d like to think that I am) which I happily shared some basic words.<\/p>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/b\/f\/63679_1219x676.jpg\" alt=\"\" width=\"1219\" height=\"676\" \/><\/p>\n<p>I didn’t hear any violent crime during the time I was there. In fact, I’m amazed by how isolated the country is. Bagan for example is the touristy town that I’ve visited in Myanmar. Locals in New Bagan where I stayed at are meticulous of their time at night, that no one should make any noise or fuss in respect to the neighbourhood. No disco bars, karaoke and no buying and selling of alcohol drinks after 10pm, this is also the same in Nyaung Shwe (Inle Lake) and Hpa-an. Yangon, on the other hand, is the city that I didn’t get to observe well at night, as I only stayed 1 night there. I went home late around 10pm after I had dinner with a new friend in Rangoon. We walked through the streets, yet, there were few people busy fixing their stores and only saw limited cars passed by (yes, didn’t hear any karaoke too).<\/p>\n<p>I met travellers or other tourists who got sick with food poisoning, perhaps, they were also dehydrated because of the overwhelming high weather temperature. In my opinion, food is okay. Some of their food were really good, yet, a few weren’t. Through my curiosity, I had tasted their street food like tofu salad, ginger salad, mutton testicles with rice, and my favourite, wat thar toak htoe or pork stick. Unfortunately, on my FIRST Burmese meal, the bamboo salad food they served was tasteless and dull that almost made me throw up. The smell and its tastes affected my appetite on every Burmese meal. Luckily, I’m excellent the whole time despite the “bamboo salad” that I first savoured.<\/p>\n<p><img class=\"alignnone size-large\" src=\"https:\/\/static.tripzilla.com\/thumb\/c\/0\/63680_1227x680.jpg\" alt=\"\" width=\"1227\" height=\"680\" \/><\/p>\n<p>Another factor that made me say it’s secure, is the availability of bottled water to drink. Though Myanmar has a drinking water facility on most every corner, they also provide water for a cost to the tourists, except in bus rides where they cater water for free to all passengers.<\/p>\n<p>I only encountered fewer scammers for tourists, which can be easily detected through the first conversation. There were a couple in Bagan.<\/p>\n<p>Transportation like the bus or other public transport is well organised by a majority of the operators. They monitor well who their passengers are. To feel really safer, they have VIP buses. The far distance, taking long hours of travel, had me take night buses. I really fancy their VIP buses.<\/p>\n<p><span style=\"color: #ff6600\"><em>Also read: <a style=\"color: #ff6600\" href=\"https:\/\/www.tripzilla.com\/8-places-to-visit-for-your-first-trip-to-myanmar\/24280\" target=\"_blank\">Top 5 Places to Visit on Your First Trip to Myanmar<\/a><\/em><\/span><\/p>\n<p>There is freedom to be yourself while travelling in the country. I had the freedom to wear shorts regardless of the country’s seemingly traditional dress; they show respect to the tourists wearing the opposite. I wore shorts once in Inlay and once in Yangon. Most of the time, I wore trousers. They may seem to stare at you, but I never felt being uncomfortable nor heard being bullied by the residents. (Myanmar people wear longyis for both men and women). Be cautious only in visiting their Pagodas and other tourist spots as they require you to follow a dress code.<\/p>\n<p>For emergency rescue and other means to prove that the country is safe to travel, you may, however, check their online government portal. Yangon City obviously has easy access to hospitals and other emergency response team. Bagan, Inle Lake, and Hpa-an had clinics, too. Also, their hotels, hostels, and guesthouses have an emergency kit with them.<\/p>\n<p>Lastly, the internal conflict in Myanmar didn’t affect my travel. I still feel safer. Words of advice: please be a responsible tourist; there are areas that MIGHT have a civil war with the new government, be in the loop when you are in the country or do not travel to those few areas.<\/p>\n<p>Overall, I still say it’s SAFE to travel to Myanmar. Visit the golden kingdom now while it’s still non-touristy.<\/p>\n<p>Do you now feel confident to travel to Myanmar? Hope this helps!<\/p>\n<p><em><strong>Disclaimer:<\/strong> This is my own opinion while travelling to Myanmar last May 7-17, 2016. This is based on my experience, my actual observation, and my honest perception.<\/em><\/p>\n"}]}